Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18024.h
extern volatile TMR3CLKbits_t TMR3CLKbits __at(0x297);
// bitfield macros
#define _TMR3CLK_CS_POSN                                    0x0
#define _TMR3CLK_CS_POSITION                                0x0
#define _TMR3CLK_CS_SIZE                                    0x8
#define _TMR3CLK_CS_LENGTH                                  0x8
#define _TMR3CLK_CS_MASK                                    0xFF
#define _TMR3CLK_T3CS0_POSN                                 0x0
#define _TMR3CLK_T3CS0_POSITION                             0x0
#define _TMR3CLK_T3CS0_SIZE                                 0x1
#define _TMR3CLK_T3CS0_LENGTH                               0x1
#define _TMR3CLK_T3CS0_MASK                                 0x1
#define _TMR3CLK_T3CS1_POSN                                 0x1
#define _TMR3CLK_T3CS1_POSITION                             0x1
#define _TMR3CLK_T3CS1_SIZE                                 0x1
#define _TMR3CLK_T3CS1_LENGTH                               0x1
#define _TMR3CLK_T3CS1_MASK                                 0x2
#define _TMR3CLK_T3CS2_POSN                                 0x2
#define _TMR3CLK_T3CS2_POSITION                             0x2
#define _TMR3CLK_T3CS2_SIZE                                 0x1
#define _TMR3CLK_T3CS2_LENGTH                               0x1
#define _TMR3CLK_T3CS2_MASK                                 0x4
#define _TMR3CLK_T3CS3_POSN                                 0x3
#define _TMR3CLK_T3CS3_POSITION                             0x3
#define _TMR3CLK_T3CS3_SIZE                                 0x1
#define _TMR3CLK_T3CS3_LENGTH                               0x1
#define _TMR3CLK_T3CS3_MASK                                 0x8
#define _TMR3CLK_T3CS4_POSN                                 0x4
#define _TMR3CLK_T3CS4_POSITION                             0x4
#define _TMR3CLK_T3CS4_SIZE                                 0x1
#define _TMR3CLK_T3CS4_LENGTH                               0x1
#define _TMR3CLK_T3CS4_MASK                                 0x10
#define _TMR3CLK_CS0_POSN                                   0x0
#define _TMR3CLK_CS0_POSITION                               0x0
#define _TMR3CLK_CS0_SIZE                                   0x1
#define _TMR3CLK_CS0_LENGTH                                 0x1
#define _TMR3CLK_CS0_MASK                                   0x1
#define _TMR3CLK_CS1_POSN                                   0x1
#define _TMR3CLK_CS1_POSITION                               0x1
#define _TMR3CLK_CS1_SIZE                                   0x1
#define _TMR3CLK_CS1_LENGTH                                 0x1
#define _TMR3CLK_CS1_MASK                                   0x2
#define _TMR3CLK_CS2_POSN                                   0x2
#define _TMR3CLK_CS2_POSITION                               0x2
#define _TMR3CLK_CS2_SIZE                                   0x1
#define _TMR3CLK_CS2_LENGTH                                 0x1
#define _TMR3CLK_CS2_MASK                                   0x4
#define _TMR3CLK_CS3_POSN                                   0x3
#define _TMR3CLK_CS3_POSITION                               0x3
#define _TMR3CLK_CS3_SIZE                                   0x1
#define _TMR3CLK_CS3_LENGTH                                 0x1
#define _TMR3CLK_CS3_MASK                                   0x8
#define _TMR3CLK_CS4_POSN                                   0x4
#define _TMR3CLK_CS4_POSITION                               0x4
#define _TMR3CLK_CS4_SIZE                                   0x1
#define _TMR3CLK_CS4_LENGTH                                 0x1
#define _TMR3CLK_CS4_MASK                                   0x10

// Register: T2TMR
#define T2TMR T2TMR
extern volatile unsigned char           T2TMR               __at(0x30C);
#ifndef _LIB_BUILD
asm("T2TMR equ 030Ch");
#endif
// aliases
extern volatile unsigned char           TMR2                __at(0x30C);
#ifndef _LIB_BUILD
asm("TMR2 equ 030Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2TMR                  :8;
    };
    struct {
        unsigned TMR2                   :8;
    };
} T2TMRbits_t;
extern volatile T2TMRbits_t T2TMRbits __at(0x30C);
// bitfield macros
#define _T2TMR_T2TMR_POSN                                   0x0
#define _T2TMR_T2TMR_POSITION                               0x0
#define _T2TMR_T2TMR_SIZE                                   0x8
#define _T2TMR_T2TMR_LENGTH                                 0x8
#define _T2TMR_T2TMR_MASK                                   0xFF
#define _T2TMR_TMR2_POSN                                    0x0
#define _T2TMR_TMR2_POSITION                                0x0
#define _T2TMR_TMR2_SIZE                                    0x8
#define _T2TMR_TMR2_LENGTH                                  0x8
#define _T2TMR_TMR2_MASK                                    0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned T2TMR                  :8;
    };
    struct {
        unsigned TMR2                   :8;
    };
} TMR2bits_t;
extern volatile TMR2bits_t TMR2bits __at(0x30C);
// bitfield macros
#define _TMR2_T2TMR_POSN                                    0x0
#define _TMR2_T2TMR_POSITION                                0x0
#define _TMR2_T2TMR_SIZE                                    0x8
#define _TMR2_T2TMR_LENGTH                                  0x8
#define _TMR2_T2TMR_MASK                                    0xFF
#define _TMR2_TMR2_POSN                                     0x0
#define _TMR2_TMR2_POSITION                                 0x0
#define _TMR2_TMR2_SIZE                                     0x8
#define _TMR2_TMR2_LENGTH                                   0x8
#define _TMR2_TMR2_MASK                                     0xFF

// Register: T2PR
#define T2PR T2PR
extern volatile unsigned char           T2PR                __at(0x30D);
#ifndef _LIB_BUILD
asm("T2PR equ 030Dh");
#endif
// aliases
extern volatile unsigned char           PR2                 __at(0x30D);
#ifndef _LIB_BUILD
asm("PR2 equ 030Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2PR                   :8;
    };
    struct {
        unsigned PR2                    :8;
    };
} T2PRbits_t;
