Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18024.h
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0xF475);	// @ (0x1E8E * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0xF510);	// @ (0x1EA2 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0xF511);	// @ (0x1EA2 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0xF512);	// @ (0x1EA2 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0xF513);	// @ (0x1EA2 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0xF514);	// @ (0x1EA2 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0xF515);	// @ (0x1EA2 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x8864);	// @ (0x110C * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x8865);	// @ (0x110C * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0x3081);	// @ (0x610 * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// ADSTAT<OV>
extern volatile __bit                   OV                  __at(0xE957);	// @ (0x1D2A * 8 + 7)
#define                                 OV_bit              _BIT_ACCESS(ADSTAT,7)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x1C77);	// @ (0x38E * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// SSP1STAT<P2>
extern volatile __bit                   P2                  __at(0x347C);	// @ (0x68F * 8 + 4)
#define                                 P2_bit              _BIT_ACCESS(SSP1STAT,4)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x1C97);	// @ (0x392 * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// CM1PCH<PCH0>
extern volatile __bit                   PCH0                __at(0x8478);	// @ (0x108F * 8 + 0)
#define                                 PCH0_bit            _BIT_ACCESS(CM1PCH,0)
// CM1PCH<PCH1>
extern volatile __bit                   PCH1                __at(0x8479);	// @ (0x108F * 8 + 1)
#define                                 PCH1_bit            _BIT_ACCESS(CM1PCH,1)
// CM1PCH<PCH2>
extern volatile __bit                   PCH2                __at(0x847A);	// @ (0x108F * 8 + 2)
#define                                 PCH2_bit            _BIT_ACCESS(CM1PCH,2)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x3496);	// @ (0x692 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0xE939);	// @ (0x1D27 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2490);	// @ (0x492 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0xE93F);	// @ (0x1D27 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0xF060);	// @ (0x1E0C * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0xE920);	// @ (0x1D24 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0xE921);	// @ (0x1D24 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0xE92A);	// @ (0x1D25 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0xE92B);	// @ (0x1D25 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0xE92C);	// @ (0x1D25 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0xE922);	// @ (0x1D24 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0xE923);	// @ (0x1D24 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0xE924);	// @ (0x1D24 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0xE925);	// @ (0x1D24 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0xE926);	// @ (0x1D24 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0xE927);	// @ (0x1D24 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0xE928);	// @ (0x1D25 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0xE929);	// @ (0x1D25 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0xE958);	// @ (0x1D2B * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0xE959);	// @ (0x1D2B * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0xE8D8);	// @ (0x1D1B * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0xE8D9);	// @ (0x1D1B * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0xE8E2);	// @ (0x1D1C * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0xE8E3);	// @ (0x1D1C * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0xE8E4);	// @ (0x1D1C * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0xE8E5);	// @ (0x1D1C * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0xE8E6);	// @ (0x1D1C * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0xE8E7);	// @ (0x1D1C * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0xE8DA);	// @ (0x1D1B * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0xE8DB);	// @ (0x1D1B * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0xE8DC);	// @ (0x1D1B * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0xE8DD);	// @ (0x1D1B * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0xE8DE);	// @ (0x1D1B * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0xE8DF);	// @ (0x1D1B * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0xE8E0);	// @ (0x1D1C * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0xE8E1);	// @ (0x1D1C * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0xE947);	// @ (0x1D28 * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// DAC1CON<PSS0>
extern volatile __bit                   PSS0                __at(0x8862);	// @ (0x110C * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC1CON,2)
// DAC1CON<PSS1>
extern volatile __bit                   PSS1                __at(0x8863);	// @ (0x110C * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC1CON,3)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x2077);	// @ (0x40E * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x2075);	// @ (0x40E * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x2074);	// @ (0x40E * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x208F);	// @ (0x411 * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x208D);	// @ (0x411 * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x208C);	// @ (0x411 * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x20A7);	// @ (0x414 * 8 + 7)
#define                                 PWM5EN_bit          _BIT_ACCESS(PWM5CON,7)
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x20A5);	// @ (0x414 * 8 + 5)
#define                                 PWM5OUT_bit         _BIT_ACCESS(PWM5CON,5)
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x20A4);	// @ (0x414 * 8 + 4)
#define                                 PWM5POL_bit         _BIT_ACCESS(PWM5CON,4)
// NCO1CLK<PWS0>
extern volatile __bit                   PWS0                __at(0x249D);	// @ (0x493 * 8 + 5)
#define                                 PWS0_bit            _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<PWS1>
extern volatile __bit                   PWS1                __at(0x249E);	// @ (0x493 * 8 + 6)
#define                                 PWS1_bit            _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<PWS2>
extern volatile __bit                   PWS2                __at(0x249F);	// @ (0x493 * 8 + 7)
#define                                 PWS2_bit            _BIT_ACCESS(NCO1CLK,7)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE3<RC1IE>
extern volatile __bit                   RC1IE               __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE3,3)
// PIR3<RC1IF>
extern volatile __bit                   RC1IF               __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR3,3)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0xE480);	// @ (0x1C90 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// FVRCON<RDY>
extern volatile __bit                   RDY                 __at(0x8066);	// @ (0x100C * 8 + 6)
#define                                 RDY_bit             _BIT_ACCESS(FVRCON,6)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// DAC1CON<REFRNG>
extern volatile __bit                   REFRNG              __at(0x8866);	// @ (0x110C * 8 + 6)
#define                                 REFRNG_bit          _BIT_ACCESS(DAC1CON,6)
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0xE8E8);	// @ (0x1D1D * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(ADRESL,0)
// ADRESL<RES1>
extern volatile __bit                   RES1                __at(0xE8E9);	// @ (0x1D1D * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(ADRESL,1)
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0xE8F2);	// @ (0x1D1E * 8 + 2)
#define                                 RES10_bit           _BIT_ACCESS(ADRESH,2)
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0xE8F3);	// @ (0x1D1E * 8 + 3)
#define                                 RES11_bit           _BIT_ACCESS(ADRESH,3)
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0xE8F4);	// @ (0x1D1E * 8 + 4)
#define                                 RES12_bit           _BIT_ACCESS(ADRESH,4)
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0xE8F5);	// @ (0x1D1E * 8 + 5)
#define                                 RES13_bit           _BIT_ACCESS(ADRESH,5)
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0xE8F6);	// @ (0x1D1E * 8 + 6)
#define                                 RES14_bit           _BIT_ACCESS(ADRESH,6)
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0xE8F7);	// @ (0x1D1E * 8 + 7)
#define                                 RES15_bit           _BIT_ACCESS(ADRESH,7)
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0xE8EA);	// @ (0x1D1D * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(ADRESL,2)
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0xE8EB);	// @ (0x1D1D * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(ADRESL,3)
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0xE8EC);	// @ (0x1D1D * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(ADRESL,4)
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0xE8ED);	// @ (0x1D1D * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(ADRESL,5)
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0xE8EE);	// @ (0x1D1D * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(ADRESL,6)
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0xE8EF);	// @ (0x1D1D * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(ADRESL,7)
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0xE8F0);	// @ (0x1D1E * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(ADRESH,0)
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0xE8F1);	// @ (0x1D1E * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(ADRESH,1)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0xE8D0);	// @ (0x1D1A * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0xE8D1);	// @ (0x1D1A * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0xE8D2);	// @ (0x1D1A * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0xE8D3);	// @ (0x1D1A * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0xE8D4);	// @ (0x1D1A * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0xE8D5);	// @ (0x1D1A * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0xE8D6);	// @ (0x1D1A * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0xE8D7);	// @ (0x1D1A * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// RC1STA<RX9>
